export const TERRITORY_LABELS = [
  { id: 'street_vyshyvanka', text: 'вул. Вишиванка', x: 4050, y: 130, fontSize: 150, color: '#9CA3AF' },
  { id: 'label_corp1', text: 'Корпус 1', fontSize: 200, color: '#1E293B',
    x: 4250,       
    y: 1200 },
  { id: 'label_corp2', text: 'Корпус 2', fontSize: 200, color: '#1E293B',
    x: 6000,       
    y: 2850 }
];

export const TERRITORY_VIEWBOX = "0 0 7264 10409";

export const TERRITORY_WALLS = "M7263.5 257.5L0 257.5M7263.5 0.5L0 0.5M4847.5 3309H5345.62V3414L5700 3414V3309H6277V3386H6478V3309H7146.5V2412.14H5891.07V2198.74H5857.7V2210.08H5504.97V2198.36L5472 2198.74V2412.14H4847.5V2658H4697V1502H5000L5000 775.5H4275.5V598.672L3840.5 600.854V775.5L2296 775.5V1502H2532.58V1704.56H2370L2370 2729H2976.5L2976.5 1704.56H2867.5V1502H3744L3744 3309H4697V2927.12H4847.5V3038.5M4847.5 3309V3038.5M4847.5 3309H4772.25V3038.5H4847.5M3721.55 8926.5V9366.5H4531.54V10408.5L1788.5 10408.5V8926.5H3067.42L3721.55 8926.5ZM1481 3683.5H321.5L321.5 6828.5H1481L1481 3683.5ZM4927.5 7768.76L4927.5 4911.3L4819.68 4645.49L4662.27 4501.51L4401.36 4407H4157.7L3885.29 4501.51L3686.19 4645.49L3587 4911.3L3587 7768.76L3686.19 8059.68L3885.29 8233.19L4157.7 8344.69H4401.36L4662.27 8233.19L4819.68 8059.68L4927.5 7768.76ZM3092.5 6323L3092.5 4407L1969 4407L1969 6323L3092.5 6323ZM6044.5 3660.5H7146.5L7146.5 5872.5V6890H6612.5V5933.5H6044.5V5906H6062L6062 3683.5H6044.5V3660.5ZM5345.62 7879.69L5345.62 4720.12L5178.8 4426.21L4935.24 4267L4531.54 4162.5H4154.53L3733.03 4267L3424.97 4426.21L3271.5 4720.12L3271.5 7303L2280.5 8664.5H2459.5L3271.5 7517.5L3271.5 7879.69L3424.97 8233.44L3733.03 8444.43L4154.53 8580H4531.54L4927.5 8444.43L5178.8 8201.36L5345.62 7879.69ZM1916 3951V3981L3954.5 3981V3951L1916 3951ZM5593 3951L4363 3951V3981L5563 3981V5300H5593V3951ZM5593 7097H5563L5563 5379.5H5593L5593 7097Z"

export const TERRITORY_ROADS = [
  "0,0 7260,0 7260,250 0,250" 
];

export const TERRITORY_BUILDINGS = [
  { id: 'b_main', label: '', building: 0, floor: 0, fontSize: 200, points: "2300,780 3840,780 3840,600 4275,600 4275,780 5000,780 5000,1500 4700,1500 4700,2660 4850,2660 4850,2410 5470,2410 5470,2195 5505,2195 5505,2210 5855,2210 5855,2195 5895,2195 5895,2410 7150,2410 7150,3310 6480,3310 6480,3390 6275,3390 6275,3310 5700,3310 5700,3415 5345,3415 5345,3310 4770,3310 4770,3035 4845,3035 4845,2930 4700,2930 4700,3310 3740,3310 3740,1500 2870,1500 2870,1705 2980,1705 2980,2730 2370,2730 2370,1705 2530,1705 2530,1500 2300,1500" },
  { id: 'b_workshop', label: 'Виробничі\nмайстерні', building: 0, floor: 0, fontSize: 200, points: "6040,3660 7150,3660 7150,6890 6610,6890 6610,5935 6040,5935 6040,5905 6060,5905 6060,3685 6040,3685", textX: 6600, textY: 5000 },
  { id: 'b_sports', label: 'Спорткомлекс', building: 0, floor: 0, fontSize: 200, points: "1790,8925 3720,8925 3720,9360 4530,9360 4530,10400 1790,10400" },
  { id: 'dorm', label: 'Гуртожиток', building: 0, floor: 0, fontSize: 200, x: 320, y: 3680, width: 1160, height: 3150 },
  { id: 'stadium', label: 'Стадіон', building: 0, floor: 0, fontSize: 200, points: "3585,4910 3680,4650 3880,4500 4180,4400 4400,4400 4660,4500 4830,4650 4930,4910 4930,7770 4830,8050 4660,8230 4400,8350 4180,8350 3880,8230 3680,8050 3585,7770" },
  { id: 'court', label: 'Баскетбольний \n майданчик', building: 0, floor: 0, fontSize: 200, x: 1970, y: 4410, width: 1120, height: 1910 },

  { id: 'shelter_1', label: '', description: 'Вхід в укриття №1', building: 0, floor: 0, fontSize: 150, x: 4800, y: 3325, width: 0, height: 0 },
  { id: 'shelter_2', label: '', description: 'Вхід в укриття №2', building: 0, floor: 0, fontSize: 150, x: 6375, y: 3325, width: 0, height: 0 },
];

export const TERRITORY_NODES = [      
  { id: 'entrance_b1', x: 5520, y: 3350 }, // Точка виходу з Головного корпусу (Вхід 2)
  { id: 't_node_1', x: 5520, y: 3700 },    // Йдемо вниз
  { id: 't_node_2', x: 5800, y: 3700 },    // Повертаємо направо
  { id: 't_node_3', x: 5800, y: 5500 },    // Йдемо вниз вздовж майстерні
  { id: 'entrance_b2', x: 6060, y: 5500 },  // Точка входу в Майстерні

  { id: 'entrance_b3', x: 2350, y: 8900 },   // Точка входу в Спорткомлекс
  { id: 't_node_4', x: 4170, y: 3700 },    // Йдемо вліво вздовж корпусів 1/2
  { id: 't_node_5', x: 4170, y: 4250 },    // йдемо вниз до стадіону
  { id: 't_node_6', x: 3430, y: 4670 },    // Йдемо вниз вздовж спорткомплексу
  { id: 't_node_7', x: 3430, y: 7200 },    
  { id: 't_node_8', x: 2350, y: 8680 },

  { id: 'stadium', x: 4170, y: 6500 },    
  { id: 'court', x: 2700, y: 4670 },

  { id: 'dorm', x: 1400, y: 6650 },
  { id: 't_node_9', x: 1700, y: 3700 },
  { id: 't_node_10', x: 1700, y: 6650 },

  { id: 'shelter_1', x: 4800, y: 3325 },
  { id: 'shelter_2', x: 6375, y: 3325 },
  { id: 'c_shelter_1', x: 4800, y: 3700 },
  { id: 'c_shelter_2', x: 6375, y: 3530 },
  { id: 't_node_11', x: 5520, y: 3530 },
];

export const TERRITORY_EDGES = [
  // маршрут до майстерні
  { from: 'entrance_b1', to: 't_node_1' }, 
  { from: 't_node_1', to: 't_node_2' },  
  { from: 't_node_2', to: 't_node_3' },
  { from: 't_node_3', to: 'entrance_b2' },

  // маршрут до спорткомплексу
  { from: 't_node_1', to: 'c_shelter_1' },
  { from: 'c_shelter_1', to: 't_node_4' },
  { from: 't_node_4', to: 't_node_5' },
  { from: 't_node_5', to: 't_node_6' },
  { from: 't_node_6', to: 't_node_7' },
  { from: 't_node_7', to: 't_node_8' },
  { from: 't_node_8', to: 'entrance_b3' },

  // маршрут до стадіону
  { from: 't_node_4', to: 't_node_5' },
  { from: 't_node_5', to: 'stadium' },

  { from: 't_node_6', to: 'court' }, // маршрут до баскетбольного майданчика

  // маршрут до гуртожитку
  { from: 't_node_4', to: 't_node_9' },
  { from: 't_node_9', to: 't_node_10' },
  { from: 't_node_10', to: 'dorm' },

  // маршрут до укриття 1
  { from: 'c_shelter_1', to: 'shelter_1' },

  // маршрут до укриття 2
  { from: 'entrance_b1', to: 't_node_11' },
  { from: 't_node_11', to: 'c_shelter_2' },
  { from: 'c_shelter_2', to: 'shelter_2' },

];


export const TERRITORY_START_POINTS: any[] = [
  { id: 'entrance_b1', label: 'Вихід з корп. 1', x: 5520, y: 3350 },
  { id: 'entrance_b2', label: 'Вхід до майстерні', x: 6060, y: 5500 },
  { id: 'entrance_b3', label: 'Вхід до спорткомлексу', x: 2350, y: 8900 },
  { id: 'dorm', label: 'Вхід до гуртожитку', x: 1480, y: 6650 },
  { id: 'shelter_1', label: 'Вхід до\n укриття 1', x: 4800, y: 3325, fontSize: 150, lineHeight: 130, textY: -220 },
  { id: 'shelter_2', label: 'Вхід до\n укриття 2', x: 6375, y: 3325, fontSize: 150, lineHeight: 130, textY: -220 },
];